InformationRegisters/ПраваИНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПраваИНастройки</Name>
			<Comment>Хранит права доступа и настройки окружения пользователей</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение права / настройки</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПраваИНастройки</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект, на уровне которого производится настройка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравоНастройка</Name>
					<Comment>Право или настройка, по которой хранится значение</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПраваИНастройки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтпускаКассиров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОтпускаКассиров</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачалаОтпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияОтпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Замещает</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/СМ_УправлениеДоступом/Ext/Module.bsl
Процедура ОткрытьВсеЭлементыФормы(Форма) Экспорт
	Для Каждого ТекЭлемент из Форма.ЭлементыФормы Цикл
		РазрешитьРедактирование(Форма,ТекЭлемент);
	КонецЦикла;
	
	// Бондаренко++ 20211224
	ОбъектМетаданных = Форма.Ссылка.Метаданные();
	Если Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		Попытка
			КоманднаяПанельОсновныеДействия = Форма.ЭлементыФормы.ОсновныеДействияФормы;
			Если ТипЗнч(КоманднаяПанельОсновныеДействия) = Тип("КоманднаяПанель") Тогда
				КоманднаяПанельОсновныеДействия.Доступность = Истина;
				Для Каждого КнопкаПанели Из КоманднаяПанельОсновныеДействия.Кнопки Цикл
					КнопкаПанели.Доступность = Истина;
				КонецЦикла;
			КонецЕсли;		
		Исключение
		КонецПопытки;
	КонецЕсли;
	// Бондаренко-- 20211224

КонецПроцедуры
 
Процедура ЗакрытьВсеЭлементыФормы(Форма) Экспорт
	Для Каждого ТекЭлемент из Форма.ЭлементыФормы Цикл
		Если ТипЗнч(ТекЭлемент) = Тип("Надпись") Тогда			
			Продолжить;
		КонецЕсли;
		
 		Попытка	
			ТекЭлемент.ТолькоПросмотр = Истина; 
		Исключение
			Если ТипЗнч(ТекЭлемент)<>Тип("Панель") Тогда
 				Попытка	
					ТекЭлемент.Доступность = Ложь;  
				Исключение 
					//
				КонецПопытки;
			КонецЕсли;						
		КонецПопытки;
	КонецЦикла;
	Попытка
		ЗапретитьРедактированиеКолонок(Форма.ЭлементыФормы.Товары);
	Исключение
		//	
	КонецПопытки; 
	
	// Семенихин 17.12.2021 +++++
	ОбъектМетаданных = Форма.Ссылка.Метаданные();
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		Попытка
			КоманднаяПанельДействия = Форма.ЭлементыФормы.ДействияФормы;
			Если ТипЗнч(КоманднаяПанельДействия) = Тип("КоманднаяПанель") Тогда
				КоманднаяПанельДействия.Доступность = Истина; 
			КонецЕсли;		
		Исключение
		КонецПопытки;		
	
	ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		Попытка
			КоманднаяПанельДействия = Форма.ЭлементыФормы.ДействияФормы;
			Если ТипЗнч(КоманднаяПанельДействия) = Тип("КоманднаяПанель") Тогда
				КоманднаяПанельДействия.Доступность = Истина;
			КонецЕсли;		
		Исключение
		КонецПопытки;
		Попытка
			КоманднаяПанельОсновныеДействия = Форма.ЭлементыФормы.ОсновныеДействияФормы;
			Если ТипЗнч(КоманднаяПанельОсновныеДействия) = Тип("КоманднаяПанель") Тогда
				КоманднаяПанельОсновныеДействия.Доступность = Истина;
				Для Каждого КнопкаПанели Из КоманднаяПанельОсновныеДействия.Кнопки Цикл
					КнопкаПанели.Доступность = Ложь;
				КонецЦикла;
				//Бондаренко++ 20211224 
				Попытка КоманднаяПанельОсновныеДействия.Кнопки.Закрыть.Доступность = Истина; Исключение	КонецПопытки; 
				Попытка КоманднаяПанельОсновныеДействия.Кнопки.ДействиеЗакрыть.Доступность = Истина; Исключение	КонецПопытки; 
				//Бондаренко-- 20211224 
			КонецЕсли;		
		Исключение
		КонецПопытки;
	КонецЕсли;
	// Семенихин 20.12.2021 -----
КонецПроцедуры
 
//Бондаренко++ 20210825
Процедура РазрешитьРедактирование(Форма,ТекЭлемент) Экспорт
	Попытка	
		ТекЭлемент.ТолькоПросмотр = Ложь; 
	Исключение	
		Попытка	
			ТекЭлемент.Доступность = Истина;  
		Исключение 
			//
		КонецПопытки;
	КонецПопытки;
	//Бондаренко++ 20210827
	Попытка
		РазрешитьРедактированиеКолонок(Форма.ЭлементыФормы.Товары,ТекЭлемент,"");
	Исключение
		//	
	КонецПопытки;
	//Бондаренко-- 20210827
КонецПроцедуры	

Процедура РазрешитьРедактированиеКолонок(Форма,ТекЭлемент,СписокКолонок) Экспорт
	Если ТипЗнч(ТекЭлемент)=Тип("ТабличноеПоле") Тогда
		СписокЗн = РазложитьСтрокуВСписок(СписокКолонок,";");
 		Для каждого ТекКолонка Из ТекЭлемент.Колонки Цикл
			Если СписокЗн.Количество() > 0 Тогда
	 			Если СписокЗн.НайтиПоЗначению(ТекКолонка.Имя)<>Неопределено Тогда
					ТекКолонка.ТолькоПросмотр=Ложь;	
 				КонецЕсли; 
			Иначе
				ТекКолонка.ТолькоПросмотр=Ложь;	
 			КонецЕсли; 
  		КонецЦикла; 
	КонецЕсли;
 КонецПроцедуры	

Процедура ЗапретитьРедактированиеКолонок(ТекЭлемент) Экспорт
	Если ТипЗнч(ТекЭлемент) = Тип("ТабличноеПоле") Тогда
		Для каждого ТекКолонка Из ТекЭлемент.Колонки Цикл
	 		ТекКолонка.ТолькоПросмотр=Истина;	
	 	КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

Функция РазложитьСтрокуВСписок(Знач ИсходнаяСтрока, Разделитель = ";") Экспорт
	
	//Сначала получаем массив
	Если СокрЛП(ИсходнаяСтрока) = "" Тогда
		МассивСтрок = Новый Массив;
 	Иначе
		МассивСтрок = РазложитьСтрокуВМассивПодстрок(ИсходнаяСтрока, ";");
 	КонецЕсли; 
 	
	//Теперь массив загружаем в СписокЗначений
	СписокСтрок = Новый СписокЗначений;
	СписокСтрок.ЗагрузитьЗначения(МассивСтрок);

	Возврат СписокСтрок;
	
КонецФункции // РазложитьСтрокуВСписок(Знач ИсходнаяСтрока, Разделитель = ";")

Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ";") Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции // РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ";")
//Бондаренко-- 20210825

//Бондаренко++ 20210901
Процедура ОткрытьЭлементыФормы(Форма) Экспорт
	Для Каждого ТекЭлемент из Форма.ЭлементыФормы Цикл
		РазрешитьРедактированиеЭлемента(ТекЭлемент);
	КонецЦикла; 
 	// Бондаренко++ 20211224
	ОбъектМетаданных = Форма.Ссылка.Метаданные();
	Если Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		Попытка
			КоманднаяПанельОсновныеДействия = Форма.ЭлементыФормы.ОсновныеДействияФормы;
			Если ТипЗнч(КоманднаяПанельОсновныеДействия) = Тип("КоманднаяПанель") Тогда
				КоманднаяПанельОсновныеДействия.Доступность = Истина;
				Для Каждого КнопкаПанели Из КоманднаяПанельОсновныеДействия.Кнопки Цикл
					КнопкаПанели.Доступность = Истина;
				КонецЦикла;
			КонецЕсли;		
		Исключение
		КонецПопытки;
	КонецЕсли;
	// Бондаренко-- 20211224
КонецПроцедуры
 
Процедура РазрешитьРедактированиеЭлемента(ТекЭлемент) Экспорт
	Попытка	
		ТекЭлемент.ТолькоПросмотр = Ложь; 
	Исключение	
		Попытка	
			ТекЭлемент.Доступность = Истина;  
		Исключение 
			//
		КонецПопытки;
	КонецПопытки;
 	Если ТипЗнч(ТекЭлемент)=Тип("ТабличноеПоле") Тогда
 		Попытка
			РазрешитьРедактированиеВсехКолонок(ТекЭлемент,"");
		Исключение
			//	
		КонецПопытки;
	КонецЕсли;
	// Семенихин 09.02.2022 +++++
 	Если ТипЗнч(ТекЭлемент) = Тип("КоманднаяПанель") Тогда
		Для Каждого КнопкаПанели Из ТекЭлемент.Кнопки Цикл
			КнопкаПанели.Доступность = Истина;
		КонецЦикла;
	КонецЕсли;	
	// Семенихин 09.02.2022 -----
КонецПроцедуры
  
Процедура РазрешитьРедактированиеВсехКолонок(ТекЭлемент,СписокКолонок) Экспорт
	Если ТипЗнч(ТекЭлемент)=Тип("ТабличноеПоле") Тогда
		СписокЗн = РазложитьСтрокуВСписок(СписокКолонок,";");
 		Для каждого ТекКолонка Из ТекЭлемент.Колонки Цикл
			Если СписокЗн.Количество() > 0 Тогда
	 			Если СписокЗн.НайтиПоЗначению(ТекКолонка.Имя)<>Неопределено Тогда
					ТекКолонка.ТолькоПросмотр=Ложь;	
 				КонецЕсли; 
			Иначе
				ТекКолонка.ТолькоПросмотр=Ложь;	
 			КонецЕсли; 
  		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры	

Процедура ОткрытьВсеЭлементыФормыСКомментарием(Форма) Экспорт
 	Сообщить("Открыть все элементы ==="); 
 	Счетчик = 0;
 	Для Каждого ТекЭлемент из Форма.ЭлементыФормы Цикл
		Счетчик = Счетчик + 1;
		РазрешитьРедактирование(Форма,ТекЭлемент);
		Сообщить(СокрЛП(Счетчик)+").Разрешено редактировать элемент "+ТекЭлемент.Имя);
		Попытка
		    Сообщить(ТекЭлемент.Значение);
 		Исключение
			//		
		КонецПопытки; 
	КонецЦикла;
КонецПроцедуры

Процедура ЗакрытьВсеЭлементыФормыСКомментарием(Форма) Экспорт
 	Сообщить("Закрыть все элементы ===");
 	Счетчик = 0;
  	Для Каждого ТекЭлемент из Форма.ЭлементыФормы Цикл
 		Счетчик = Счетчик + 1;
 		Попытка	
			ТекЭлемент.ТолькоПросмотр = Истина; 
			Сообщить(СокрЛП(Счетчик)+").Включено свойство ТолькоПросмотр "+ТекЭлемент.Имя);	
		Исключение
			Если ТипЗнч(ТекЭлемент)<>Тип("Панель") Тогда
				Попытка	
					ТекЭлемент.Доступность = Ложь;  
					Сообщить(СокрЛП(Счетчик)+").Удалена Доступность "+ТекЭлемент.Имя);	
				Исключение 
					//
				КонецПопытки;
  			КонецЕсли;	
 		КонецПопытки; 
	КонецЦикла;
	Попытка
		ЗапретитьРедактированиеКолонок(Форма.ЭлементыФормы.Товары);
	Исключение
		//	
	КонецПопытки; 
КонецПроцедуры
//Бондаренко-- 20210901

// Семенихин 30.09.2021 +++++
Процедура НастроитьОтборПоПодразделениям(ЭтаФорма, Подразделение, Отбор) Экспорт
	Если Отбор = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	сзГруппыПодразделений = Новый СписокЗначений();
	сзГруппыПодразделений.Добавить(Подразделение);
	
	//Бондаренко++ 20220908
	ТекущийСотрудник = ПараметрыСеанса.Пользователь.Сотрудник;
	Если ЗначениеЗаполнено(ТекущийСотрудник) Тогда
		Для Каждого СтрокаПодразделение Из ТекущийСотрудник.ТаблицаПодразделенийРаботы Цикл
			Если СтрокаПодразделение.ПодразделениеРаботы = Подразделение Тогда
				Продолжить;
			КонецЕсли;	
			Если СтрокаПодразделение.ПодразделениеРаботы = Справочники.ПодразделенияКомпании.ОсновноеПодразделение Тогда
				Продолжить;				
			КонецЕсли;
			сзГруппыПодразделений.Добавить(СтрокаПодразделение.ПодразделениеРаботы);
		КонецЦикла;
	КонецЕсли;             
	//Бондаренко++ 20220908
	
	ЗапросПодразделения = Новый Запрос;
	ЗапросПодразделения.Текст =
	"ВЫБРАТЬ
	|ПодразделенияКомпании.Ссылка
	|ИЗ
	|Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|ГДЕ
	|ПодразделенияКомпании.Ссылка В ИЕРАРХИИ(&Подразделение)";
	
	сзПодразделенияОтбора = Новый СписокЗначений();
	Для Каждого ЗлементГруппа Из сзГруппыПодразделений Цикл
		ЗапросПодразделения.Параметры.Вставить("Подразделение", ЗлементГруппа.Значение);
		мПодразделенияОтбора = ЗапросПодразделения.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		Для Каждого ПодразделениеОтбора Из мПодразделенияОтбора Цикл
			сзПодразделенияОтбора.Добавить(ПодразделениеОтбора);
		КонецЦикла;		
	КонецЦикла;
	
	Если ЭтаФорма.ЭлементыФормы.Найти("ПодразделениеКомпании") <> Неопределено Тогда
		ЭтаФорма.ЭлементыФормы.ПодразделениеКомпании.Значение = Подразделение;
		//ЭтаФорма.ЭлементыФормы.ПодразделениеКомпании.Доступность = Ложь;
		//ЭтаФорма.ЭлементыФормы.Список.НастройкаОтбора.ПодразделениеКомпании.Доступность = Ложь;
		
	ИначеЕсли ЭтаФорма.ЭлементыФормы.Найти("Подразделение") <> Неопределено Тогда
		ЭтаФорма.ЭлементыФормы.Подразделение.Значение = Подразделение;
		//ЭтаФорма.ЭлементыФормы.Подразделение.Доступность = Ложь;
		//ЭтаФорма.ЭлементыФормы.Список.НастройкаОтбора.Подразделение.Доступность = Ложь;
	КонецЕсли;
	
	Если Отбор.Найти("ПодразделениеКомпании") <> Неопределено Тогда
		Отбор.ПодразделениеКомпании.ВидСравнения  = ВидСравнения.ВСписке;
		Отбор.ПодразделениеКомпании.Значение  = сзПодразделенияОтбора;
		Отбор.ПодразделениеКомпании.Использование  = Истина;
		
	ИначеЕсли Отбор.Найти("Подразделение") <> Неопределено Тогда
		Отбор.Подразделение.ВидСравнения  = ВидСравнения.ВСписке;
		Отбор.Подразделение.Значение  = сзПодразделенияОтбора;
		Отбор.Подразделение.Использование  = Истина;
	КонецЕсли;	
КонецПроцедуры

Процедура УстановитьДоступКДокументу(ФормаДокумента) Экспорт
	Если обЗначениеНеЗаполнено(ФормаДокумента) Тогда
		Возврат;
	ИначеЕсли ФормаДокумента.ЭтоНовый() Тогда
		Возврат;
	Иначе
		омДокумент = ФормаДокумента.ДокументОбъект.Метаданные();
	КонецЕсли;
	
	Если омДокумент.Реквизиты.Найти("ПодразделениеКомпании") <> Неопределено Тогда
		ПодразделениеДокумента = ФормаДокумента.ДокументОбъект.ПодразделениеКомпании;
	ИначеЕсли омДокумент.Реквизиты.Найти("Подразделение") <> Неопределено Тогда
		ПодразделениеДокумента = ФормаДокумента.ДокументОбъект.Подразделение;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(ПодразделениеДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросПодразделения = Новый Запрос;
	ЗапросПодразделения.Текст =
	"ВЫБРАТЬ
	|ПодразделенияКомпании.Ссылка
	|ИЗ
	|Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|ГДЕ
	|ПодразделенияКомпании.Ссылка В ИЕРАРХИИ(&Подразделение)";
	
	сзГруппыПодразделений = Новый СписокЗначений();
	ТекущийСотрудник = ПараметрыСеанса.Пользователь.Сотрудник;
	Если ЗначениеЗаполнено(ТекущийСотрудник) Тогда
		Для Каждого СтрокаПодразделение Из ТекущийСотрудник.ТаблицаПодразделенийРаботы Цикл
			сзГруппыПодразделений.Добавить(СтрокаПодразделение.ПодразделениеРаботы);
		КонецЦикла;
	КонецЕсли;
	
	ЭтоЧужойДокумент = Истина;
	Для Каждого ЗлементГруппа Из сзГруппыПодразделений Цикл
		ЗапросПодразделения.Параметры.Вставить("Подразделение", ЗлементГруппа.Значение);
		мПодразделенияОтбора = ЗапросПодразделения.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		Если мПодразделенияОтбора.Найти(ПодразделениеДокумента) <> Неопределено Тогда
			ЭтоЧужойДокумент = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ФормаДокумента.ТолькоПросмотр = ЭтоЧужойДокумент;
КонецПроцедуры

Процедура УстановитьПодразделениеДляОтбора(ПользовательСсылка, ПодразделениеДляОтбора) Экспорт
	мзПраваИНастройки = РегистрыСведений.ПраваИНастройки.СоздатьМенеджерЗаписи();
	мзПраваИНастройки.Объект = ПользовательСсылка;
	мзПраваИНастройки.ПравоНастройка = ПланыВидовХарактеристик.ПраваИНастройки.ПодразделениеДляПросмотраИОтбора;
	Если ЗначениеЗаполнено(ПодразделениеДляОтбора) Тогда
		мзПраваИНастройки.Значение = ПодразделениеДляОтбора;
		Попытка
			мзПраваИНастройки.Записать();
		Исключение
			Сообщить("Не удалось сохранить настройку ПодразделениеДляПросмотраИОтбора!", СтатусСообщения.Внимание);
		КонецПопытки;
		
	Иначе
		мзПраваИНастройки.Прочитать();
		Если мзПраваИНастройки.Выбран() Тогда
			мзПраваИНастройки.Удалить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ЭтоРабочаяБаза() Экспорт
	СтрокаСоединения = НРег(СтрокаСоединенияИнформационнойБазы());
	Возврат Найти(СтрокаСоединения, "1cserver") > 0 И Найти(СтрокаСоединения, "alfaauto") > 0;
КонецФункции

Функция ДокументНеДоступен(ДокументСсылка) Экспорт
	Если РольДоступна("ПолныеПрава") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		ПодразделениеКомпании = ДокументСсылка.ПодразделениеКомпании;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	НеДоступен = Истина;
	ТекущийСотрудник = ПараметрыСеанса.Пользователь.Сотрудник;
	Для Каждого СтрокаПодразделение Из ТекущийСотрудник.ТаблицаПодразделенийРаботы Цикл
		Если СтрокаПодразделение.ПодразделениеРаботы = Справочники.ПодразделенияКомпании.ОсновноеПодразделение Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПодразделениеКомпании = СтрокаПодразделение.ПодразделениеРаботы 
			Или ПодразделениеКомпании.ПринадлежитЭлементу(СтрокаПодразделение.ПодразделениеРаботы) Тогда
			НеДоступен = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат НеДоступен;
КонецФункции
// Семенихин 16.12.2024 -----

Процедура ЗапретитьРедактированиеЭлемента(ТекЭлемент) Экспорт
	Попытка	
		ТекЭлемент.ТолькоПросмотр = Истина; 
	Исключение	
		Попытка	
			ТекЭлемент.Доступность = Ложь;  
		Исключение 
			//
		КонецПопытки;
	КонецПопытки;
КонецПроцедуры

Функция ПолучитьЗаменуКассира(Кассир, Организация, ДатаДок) Экспорт
	
	КассирЗамена = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтпускаКассировСрезПоследних.Кассир,
	|	ОтпускаКассировСрезПоследних.ДатаНачалаОтпуска,
	|	ОтпускаКассировСрезПоследних.ДатаОкончанияОтпуска,
	|	ОтпускаКассировСрезПоследних.Замещает,
	|	ОтпускаКассировСрезПоследних.Замещает.Сотрудник.Контрагент.ИНН КАК ИННКассира,
	|	ОтпускаКассировСрезПоследних.Замещает.Наименование КАК НаименованиеКассира
	|ИЗ
	|	РегистрСведений.ОтпускаКассиров.СрезПоследних(
	|			&ДатаДок,
	|			Кассир = &Кассир
	|				И Организация = &Организация) КАК ОтпускаКассировСрезПоследних";
	Запрос.УстановитьПараметр("Кассир", Кассир);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаДок", ДатаДок);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ДатаНачалаОтпуска < ДатаДок И ДатаДок < КонецДня(Выборка.ДатаОкончанияОтпуска) Тогда 
			КассирЗамена = Выборка.Замещает;
		КонецЕсли;
	КонецЕсли;
	
	Возврат КассирЗамена; 
	
КонецФункции
